In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("mercedes.csv",usecols=["X0","X1","X2","X3","X4","X5","X6"])
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [3]:
for i in df.columns:
    print(df[i].unique()[:7])

['k' 'az' 't' 'al' 'o' 'w' 'j']
['v' 't' 'w' 'b' 'r' 'l' 's']
['at' 'av' 'n' 'e' 'as' 'aq' 'r']
['a' 'e' 'c' 'f' 'd' 'b' 'g']
['d' 'b' 'c' 'a']
['u' 'y' 'x' 'h' 'g' 'f' 'j']
['j' 'l' 'd' 'h' 'i' 'a' 'g']

In [4]:
df['X1'].value_counts().head()

aa    833
s     598
b     592
l     590
v     408
Name: X1, dtype: int64

In [5]:
df.X1.value_counts().sort_values(ascending=False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [6]:
lst_10=df.X1.value_counts().sort_values(ascending=False).head(10).index
lst_10=list(lst_10)

In [7]:
lst_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [8]:
import numpy as np
for categories in lst_10:
    df[categories]=np.where(df['X1']==categories,1,0)

In [9]:
df

      X0 X1  X2 X3 X4  X5 X6  aa  s  b  l  v  r  i  a  c  o
0      k  v  at  a  d   u  j   0  0  0  0  1  0  0  0  0  0
1      k  t  av  e  d   y  l   0  0  0  0  0  0  0  0  0  0
2     az  w   n  c  d   x  j   0  0  0  0  0  0  0  0  0  0
3     az  t   n  f  d   x  l   0  0  0  0  0  0  0  0  0  0
4     az  v   n  f  d   h  d   0  0  0  0  1  0  0  0  0  0
...   .. ..  .. .. ..  .. ..  .. .. .. .. .. .. .. .. .. ..
4204  ak  s  as  c  d  aa  d   0  1  0  0  0  0  0  0  0  0
4205   j  o   t  d  d  aa  h   0  0  0  0  0  0  0  0  0  1
4206  ak  v   r  a  d  aa  g   0  0  0  0  1  0  0  0  0  0
4207  al  r   e  f  d  aa  l   0  0  0  0  0  1  0  0  0  0
4208   z  r  ae  c  d  aa  g   0  0  0  0  0  1  0  0  0  0

[4209 rows x 17 columns]

In [10]:
lst_10.append('X1')

In [11]:
type(lst_10),    type('X1')

(list, str)

In [12]:
lst_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o', 'X1']

In [13]:
df[lst_10]
df

      X0 X1  X2 X3 X4  X5 X6  aa  s  b  l  v  r  i  a  c  o
0      k  v  at  a  d   u  j   0  0  0  0  1  0  0  0  0  0
1      k  t  av  e  d   y  l   0  0  0  0  0  0  0  0  0  0
2     az  w   n  c  d   x  j   0  0  0  0  0  0  0  0  0  0
3     az  t   n  f  d   x  l   0  0  0  0  0  0  0  0  0  0
4     az  v   n  f  d   h  d   0  0  0  0  1  0  0  0  0  0
...   .. ..  .. .. ..  .. ..  .. .. .. .. .. .. .. .. .. ..
4204  ak  s  as  c  d  aa  d   0  1  0  0  0  0  0  0  0  0
4205   j  o   t  d  d  aa  h   0  0  0  0  0  0  0  0  0  1
4206  ak  v   r  a  d  aa  g   0  0  0  0  1  0  0  0  0  0
4207  al  r   e  f  d  aa  l   0  0  0  0  0  1  0  0  0  0
4208   z  r  ae  c  d  aa  g   0  0  0  0  0  1  0  0  0  0

[4209 rows x 17 columns]

In [14]:
import datetime
today_date=datetime.datetime.today()

In [15]:
result=[today_date-datetime.timedelta(x) for x in range(15)]

In [16]:
result

[datetime.datetime(2020, 7, 28, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 27, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 26, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 25, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 24, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 23, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 22, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 21, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 20, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 19, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 18, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 17, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 16, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 15, 14, 30, 15, 398066),
 datetime.datetime(2020, 7, 14, 14, 30, 15, 398066)]

In [17]:
df1=pd.DataFrame(result)

In [18]:
df1

                            0
0  2020-07-28 14:30:15.398066
1  2020-07-27 14:30:15.398066
2  2020-07-26 14:30:15.398066
3  2020-07-25 14:30:15.398066
4  2020-07-24 14:30:15.398066
5  2020-07-23 14:30:15.398066
6  2020-07-22 14:30:15.398066
7  2020-07-21 14:30:15.398066
8  2020-07-20 14:30:15.398066
9  2020-07-19 14:30:15.398066
10 2020-07-18 14:30:15.398066
11 2020-07-17 14:30:15.398066
12 2020-07-16 14:30:15.398066
13 2020-07-15 14:30:15.398066
14 2020-07-14 14:30:15.398066

In [19]:
df1.columns=['Day']

In [20]:
df1.head()

                         Day
0 2020-07-28 14:30:15.398066
1 2020-07-27 14:30:15.398066
2 2020-07-26 14:30:15.398066
3 2020-07-25 14:30:15.398066
4 2020-07-24 14:30:15.398066

In [21]:
df1['weekday']=df1['Day'].dt.weekday_name

AttributeError: 'DatetimeProperties' object has no attribute 'weekday_name'

In [22]:
df1['weekday']=df1['Day'].dt.day_name()
df1

                          Day    weekday
0  2020-07-28 14:30:15.398066    Tuesday
1  2020-07-27 14:30:15.398066     Monday
2  2020-07-26 14:30:15.398066     Sunday
3  2020-07-25 14:30:15.398066   Saturday
4  2020-07-24 14:30:15.398066     Friday
5  2020-07-23 14:30:15.398066   Thursday
6  2020-07-22 14:30:15.398066  Wednesday
7  2020-07-21 14:30:15.398066    Tuesday
8  2020-07-20 14:30:15.398066     Monday
9  2020-07-19 14:30:15.398066     Sunday
10 2020-07-18 14:30:15.398066   Saturday
11 2020-07-17 14:30:15.398066     Friday
12 2020-07-16 14:30:15.398066   Thursday
13 2020-07-15 14:30:15.398066  Wednesday
14 2020-07-14 14:30:15.398066    Tuesday

In [23]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7
    
    
}

df1['weekday_ordinal']=df1['weekday'].map(dictionary)
df1[:2]

                         Day  weekday  weekday_ordinal
0 2020-07-28 14:30:15.398066  Tuesday                2
1 2020-07-27 14:30:15.398066   Monday                1

In [24]:
df1['Day'].dt.day

0     28
1     27
2     26
3     25
4     24
5     23
6     22
7     21
8     20
9     19
10    18
11    17
12    16
13    15
14    14
Name: Day, dtype: int64

In [25]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [26]:
train_set.columns

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64')

In [27]:
a=train_set.select_dtypes(include=['category','object'])
a

,1,3,5,6,7,8,9,13,14
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,<=50K
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,<=50K
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,<=50K
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States,<=50K
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States,>50K
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States,<=50K
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States,<=50K
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States,>50K

In [28]:
cols = train_set.columns
num_cols = train_set._get_numeric_data().columns


res=list(set(cols) - set(num_cols))
res

[1, 3, 5, 6, 7, 8, 9, 13, 14]

In [29]:
a.columns

Int64Index([1, 3, 5, 6, 7, 8, 9, 13, 14], dtype='int64')

In [30]:
a.drop(14, axis=1, inplace=True)

C:\Users\aksha\Anaconda3\lib\site-packages\pandas\core\frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [31]:
a.columns

Int64Index([1, 3, 5, 6, 7, 8, 9, 13], dtype='int64')

In [32]:
a.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [33]:
a.columns

Index(['Employment', 'Degree', 'Status', 'Designation', 'family_job', 'Race',
       'Sex', 'Country'],
      dtype='object')

In [34]:
a.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [35]:
for feature in a.columns:
    print(feature, ":", len(a[feature].unique()), 'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [43]:
a['Country'].value_counts().sort_values(ascending=False).head(5)

 United-States    29170
 Mexico             643
 nan                583
 Philippines        198
 Germany            137
Name: Country, dtype: int64

In [57]:
a['Country']=a['Country'].str.replace("nan", "others")

C:\Users\aksha\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [58]:
a['Country'].value_counts()

0    32561
Name: Country, dtype: int64

In [59]:
b=a['Country'].mode()[0]

In [60]:
a['Country']=np.where(a['Country']=="others",b,a['Country'])

C:\Users\aksha\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [61]:
a.Country.value_counts()

0    32561
Name: Country, dtype: int64

In [62]:
train_data=train_set.select_dtypes(include=['category','object'])
train_data.drop(14, axis=1, inplace=True)
train_data.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

for feature in train_data.columns:
    print(feature, ":", len(train_data[feature].unique()), 'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

C:\Users\aksha\Anaconda3\lib\site-packages\pandas\core\frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [63]:
train_data.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [78]:
country_map=train_data['Country'].value_counts().to_dict()

In [79]:
train_data['Country']=train_data['Country'].map(country_map)
train_data.head(20)

C:\Users\aksha\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

In [64]:
df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [65]:
df['Cabin'].fillna('Missing',inplace=True)

In [66]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [67]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [68]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [69]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [70]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [71]:
enumerate(ordinal_labels,0)

In [72]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [74]:
ordinal_labels22={k:i for k,i in enumerate(ordinal_labels,0)}
ordinal_labels22

{0: 'T', 1: 'M', 2: 'A', 3: 'G', 4: 'C', 5: 'F', 6: 'B', 7: 'E', 8: 'D'}

In [75]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df['Cabin_ordinal_labels']

0      1
1      4
2      1
3      4
4      1
      ..
886    1
887    6
888    1
889    4
890    1
Name: Cabin_ordinal_labels, Length: 891, dtype: int64

In [76]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [77]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df['mean_ordinal_encode']

0      0.299854
1      0.593220
2      0.299854
3      0.593220
4      0.299854
         ...
886    0.299854
887    0.744681
888    0.299854
889    0.593220
890    0.299854
Name: mean_ordinal_encode, Length: 891, dtype: float64